{"pageProps":{"id":"25","title":"5 JavaScript Books for good start","datetime":"2017-08-07T15:14:41.577Z","summary":"Here are some #JavaScript #books I've read and I think it would be a good for you when you are #lear","content":"<p>Here are some #JavaScript #books I've read and I think it would be a good for you when you are #learning JavaScript.</p>\n<p>The books list is</p>\n<ol>\n<li><a href=\"http://amzn.to/2vxfLGm\">Eloquent JavaScript 2th edition - Marijn Haverbeke.</a></li>\n</ol>\n<ul>\n<li><a href=\"http://eloquentjavascript.net/\">Eloquent JavaScript online</a></li>\n</ul>\n<p>This is the first JavaScript book I read and do the exercises after every chapter. It include basic JavaScript syntax and DOM (Document Object Model) It is a great book for beginner to start learning JavaScript.</p>\n<ol start=\"2\">\n<li><a href=\"http://amzn.to/2veF2CH\">JavaScript: The Good Parts - Douglas Crockford</a></li>\n</ol>\n<p>This book deeply introduce JavaScript's types. Especially Function type, the book explains some conception which many programming confused in JavaScript. For example, it explain what is Function #Scope and #Closure . It would help you to clearly understand some JavaScript features.</p>\n<ol start=\"3\">\n<li><a href=\"http://amzn.to/2fmhMif\">JavaScript Patterns - Stoyan Stefanov</a></li>\n</ol>\n<p>JavaScript Patterns introduce some #patterns which is usually used in JavaScript. Those patterns would easily to see in JavaScript libraries. Also, many patterns you've used in your codebase. It would make your code reuseable and easier to extend.</p>\n<ol start=\"4\">\n<li><a href=\"http://amzn.to/2vxG7bz\">Programming JavaScript Applications - Eric Elliott</a></li>\n</ol>\n<p>After reading above three books, you might be fluently coding in JavaScript. It would be a good time to read this book to recap your JavaScript knowledges. The book help you recap your JavaScript concepts and it talk some technologies using in modern JavaScript Applications. You would learn many practical application technologies, like Restful APIs and Access control.</p>\n<ol start=\"5\">\n<li><a href=\"http://amzn.to/2vcskWI\">JavaScript Allongé - Reginald Braithwaite</a></li>\n</ol>\n<p>#Functional Programming is now popular in JavaScript world. The popular Framework, #ReactJS , and one of its state manager, #Redux , make functional programming start catching developers eyes in JavaScript Community. Also, there are some popular libraries help you coding in functional way. For example, #underscore , #lodash and #ramda are libraries make you easier coding in functional way in #JS . This book would be a great book to lead you dig JavaScript in the other way.</p>\n"},"__N_SSG":true}